###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip_association.nat-instace-eip-association must be replaced
-/+ resource "aws_eip_association" "nat-instace-eip-association" {
      ~ id                   = "eipassoc-0914319fa8511b103" -> (known after apply)
      ~ instance_id          = "i-0e06bb463dd5240d4" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-0c34a64884901434a" -> (known after apply)
      ~ private_ip_address   = "10.0.4.241" -> (known after apply)
      ~ public_ip            = "13.37.74.228" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_instance_profile.mastodon-instance-debian12-profile will be created
  + resource "aws_iam_instance_profile" "mastodon-instance-debian12-profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "mastodon-instance-debian12-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-role"
      + tags_all    = {
          + "Env" = "prd"
        }
      + unique_id   = (known after apply)
    }

  # aws_instance.mastodon-instance-debian12 will be created
  + resource "aws_instance" "mastodon-instance-debian12" {
      + ami                                  = "ami-0799d76282f8ec1e7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "mastodon-instance-debian12-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "mastodon-instance-debian12"
        }
      + tags_all                             = {
          + "Env"  = "prd"
          + "Name" = "mastodon-instance-debian12"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "26b1bf9ef0a89180361e8e62aa7cc0eab560778f"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.nat-instance must be replaced
-/+ resource "aws_instance" "nat-instance" {
      ~ ami                                  = "ami-03605ed178c26cfab" -> "ami-073ef04c366723b30" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-3:377346518720:instance/i-0e06bb463dd5240d4" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-3a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0e06bb463dd5240d4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c34a64884901434a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-4-241.eu-west-3.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.4.241" -> (known after apply)
      ~ public_dns                           = "ec2-13-37-74-228.eu-west-3.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.37.74.228" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = false -> null
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-04cb8a49007ff9679" -> (known after apply)
        tags                                 = {
            "Name" = "nat-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-02c0fa6e57cd18c58",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0cb50306e78205f28" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_key_pair.tf_key will be destroyed
  # (because aws_key_pair.tf_key is not in configuration)
  - resource "aws_key_pair" "tf_key" {
      - arn         = "arn:aws:ec2:eu-west-3:377346518720:key-pair/ssh-key-pair" -> null
      - fingerprint = "3f:f5:51:73:77:72:3c:f0:81:ed:80:08:c2:18:18:b4" -> null
      - id          = "ssh-key-pair" -> null
      - key_name    = "ssh-key-pair" -> null
      - key_pair_id = "key-0bda1cc9d59c41827" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCdbfMUVz3G26PtTqeYBxuOLIVmY4ZpYdSZGCHGExL1p5OL3dSc4l67GBMd7sr5hDmjnw7h3wcmWqZuU0cG4VymQdq9D4c9l5z3LUVFWtuyqOfn+PhodeZ6HKOzlT5yWcYE9Fk+K53xWE3AI/2YB4Wo+LuIqPG5NVTbd4l/Po3Kao1Vzo9xqNTwCqXd+JhgsvHCz/7TQo9sfNbNOMUxyjDh0zeuB+7RicfjnlLlCv+kMvDjuVBCVLi/+Ybgf3DFTb/WPwWE6V3DVlNYc2XBIii02rC2T9GJfwHIqRzdDgKidSlw4M5a6wiBlYjxfCVl8lNnSaQpCa7h5KVN4eN7m3v05oUzUnV2J/cLa4XalLkxs4+XVvC7MB/L7baFj0EpHmlZUAW67Y074cD9+8uBPdi8Qzw5x1HfkT1l3bwAJgzEvTcvOi97cGk8y20oO3pDe5t77BaD524yqkTAjDq0faKpMuzjzoj0SdeKFVWgZieb4DvReQEoVjTSSUb6C/8jqVGGnqfEb2v729FNCUVKT58R4Ycjb3qR7Br+etIrCMWeHtYJl2jiQANj2K6YJMun4z7p3Wj1ySIIEKLm2BRNz97WjOeGVlHNd2xu/MlusGbM0wgV3CJlK0ghFhE5LdYIUbHzcRprcnBs4GcB3pQ8pMHrG+0eZe53Yn810LVY11olZw==" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Env" = "prd"
        } -> null
    }

  # aws_network_interface.mastodon-instance-debian12-eni will be created
  + resource "aws_network_interface" "mastodon-instance-debian12-eni" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "sg-02c0fa6e57cd18c58",
        ]
      + source_dest_check         = true
      + subnet_id                 = "subnet-0b5c594203af13ee9"
      + tags                      = {
          + "Name" = "mastodon-instance-debian12-eni"
        }
      + tags_all                  = {
          + "Env"  = "prd"
          + "Name" = "mastodon-instance-debian12-eni"
        }
    }

  # aws_security_group.main-security-group will be updated in-place
  ~ resource "aws_security_group" "main-security-group" {
        id                     = "sg-02c0fa6e57cd18c58"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 587
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 587
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 587
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 587
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "main-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_activation.main_activation must be replaced
-/+ resource "aws_ssm_activation" "main_activation" {
      ~ activation_code    = "OngAPxmTEVG5h4v1fIBG" -> (known after apply)
      ~ expiration_date    = "2025-05-10T18:56:51Z" -> (known after apply)
      ~ expired            = true -> (known after apply)
      ~ id                 = "dd3aaa01-5d92-49ac-b7fd-2d3d21ffc06a" -> (known after apply)
        name               = "main_ssm_activation"
      ~ registration_count = 0 -> (known after apply)
      ~ registration_limit = 10 -> 5 # forces replacement
      - tags               = {} -> null
        # (2 unchanged attributes hidden)
    }

  # tls_private_key.rsa-4096-example will be destroyed
  # (because tls_private_key.rsa-4096-example is not in configuration)
  - resource "tls_private_key" "rsa-4096-example" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "5d3219203ae23f5d796dafa7af0170697ac508dc" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "52:62:b0:9b:02:25:90:91:76:e5:f0:fb:1f:5b:54:c9" -> null
      - public_key_fingerprint_sha256 = "SHA256:NCM9BfV6GFyz1gXqF/P4ebYPwn1JAAiMiXUnHN1dUe4" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCdbfMUVz3G26PtTqeYBxuOLIVmY4ZpYdSZGCHGExL1p5OL3dSc4l67GBMd7sr5hDmjnw7h3wcmWqZuU0cG4VymQdq9D4c9l5z3LUVFWtuyqOfn+PhodeZ6HKOzlT5yWcYE9Fk+K53xWE3AI/2YB4Wo+LuIqPG5NVTbd4l/Po3Kao1Vzo9xqNTwCqXd+JhgsvHCz/7TQo9sfNbNOMUxyjDh0zeuB+7RicfjnlLlCv+kMvDjuVBCVLi/+Ybgf3DFTb/WPwWE6V3DVlNYc2XBIii02rC2T9GJfwHIqRzdDgKidSlw4M5a6wiBlYjxfCVl8lNnSaQpCa7h5KVN4eN7m3v05oUzUnV2J/cLa4XalLkxs4+XVvC7MB/L7baFj0EpHmlZUAW67Y074cD9+8uBPdi8Qzw5x1HfkT1l3bwAJgzEvTcvOi97cGk8y20oO3pDe5t77BaD524yqkTAjDq0faKpMuzjzoj0SdeKFVWgZieb4DvReQEoVjTSSUb6C/8jqVGGnqfEb2v729FNCUVKT58R4Ycjb3qR7Br+etIrCMWeHtYJl2jiQANj2K6YJMun4z7p3Wj1ySIIEKLm2BRNz97WjOeGVlHNd2xu/MlusGbM0wgV3CJlK0ghFhE5LdYIUbHzcRprcnBs4GcB3pQ8pMHrG+0eZe53Yn810LVY11olZw==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAnW3zFFc9xtuj7U6nmAcb
            jiyFZmOGaWHUmRghxhMS9aeTi93UnOJeuxgTHe7K+YQ5o58O4d8HJlqmblNHBuFc
            pkHavQ+HPZec9y1FRVrbsqjn5/j4aHXmehyjs5U+clnGBPRZPiud8VhNwCP9mAeF
            qPi7iKjxuTVU23eJfz6NymqNVc6PcajU8Aql3fiYYLLxws/+00KPbHzWzTjFMcow
            4dM3rgfu0YnH455S5Qr/pDLw47lQQlS4v/mG4H9wxU2/1j8FhOldw1ZTWHNlwSIo
            tNqwtk/RiX8ByKkc3Q4ConUpcODOWusIgZWI8XwlZfJTZ0mkKQmu4eSlTeHje5t7
            9OaFM1J1dif3C2uF2pS5MbOPl1bwuzAfy+22hY9BKR5pWVAFuu2NO+HA/fvLgT3Y
            vEM8OcdR35E9Zd28ACYMxL03Lzove3BpPMttKDt6Q3ube+wWg+duMqpEwIw6tH2i
            qTLs486I9EnXihVVoGYnm+A70XkBKFY00klG+gv/I6lRhp6nxG9r+9vRTQlFSk+f
            EeGHI296kewa/nrSKwjFnh7WCZdo4kADY9iumCTLp+M+6d1o9ckiCBCi5tgUTc/e
            1oznhlZRzXdsbvzJbrBmzNMIFdwiZStIIRYROS3WCFGx83Eaa3JwbOBnAd6UPKTB
            6xvtHmXud2J/NdC1WNdaJWcCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 6 to add, 1 to change, 5 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `CD Terraform`*